---
type: ReferenceArrayArray
namespace: Autodesk.Revit.DB
version: 2024
members: 10
tags: [revit-api, class]
---

# ReferenceArrayArray

`Autodesk.Revit.DB.ReferenceArrayArray` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ReferenceArrayArray | — | `public ReferenceArrayArray ()` |
| Method | Append | — | `public virtual void Append ( ReferenceArray item )` |
| Method | Clear | — | `public virtual void Clear ()` |
| Method | ForwardIterator | — | `public virtual ReferenceArrayArrayIterator ForwardIterator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator GetEnumerator ()` |
| Method | Insert | — | `public virtual void Insert ( ReferenceArray item , int index )` |
| Method | ReverseIterator | — | `public virtual ReferenceArrayArrayIterator ReverseIterator ()` |
| Property | IsEmpty | — | `public virtual bool IsEmpty { get ; }` |
| Property | Item | — | `public virtual ReferenceArray this [ int index ] { get ; set ; }` |
| Property | Size | — | `public virtual int Size { get ; }` |